import sqlite3

connect = sqlite3.connect('Курсовые работы бд')
cursor = connect.cursor()

cursor.execute("""CREATE TABLE IF NOT EXISTS users(
        cafedra TEXT,
        group_num INT,
        user_name TEXT,
        disciplin TEXT,
        semestr INT,
        works_name TEXT

)""")

connect.commit()

users_list = ['Транспортних систем та Технічного Сервісу', 4, 'Геков Олексій Володимирович', 'Автомобілі', 8, 'Проект обладнання для ділянки прибирально-мийних робіт автомобілів з вибором засобів для підйому вантажу']
users_list2 = ['Транспортних систем та Технічного Сервісу', 4, 'Леонов Артем Дмитрович', 'Автомобілі', 8, 'Проект обладнання для ділянки підьємно – оглядових і підьємно–транспортних  механізмів  автомобілів, з вибором засобів для транспортування ']
users_list3 = ['Транспортних систем та Технічного Сервісу', 4, 'Мінєєв Микита Олександрович', 'Автомобілі', 8, 'Розрахунок тягово-швидкісних характеристик автомобіля BMW X1 з вибором обладнання для ділянки з діагностики, технічного обслуговування і ремонту двигуна']
users_list4 = ['Транспортних систем та Технічного Сервісу', 4, 'Некрасов Олексій Єгорович', 'Автомобілі', 8, 'Проект обладнання для ділянки змащення і заправки мастилами, повітрям  і робочими рідинами автомобілів  з вибором засобів для підйому тари ']
users_list5 = ['Транспортних систем та Технічного Сервісу', 4, 'Низкошапка Павло Ігоревич', 'Автомобілі', 8, 'Розрахунок тягово-швидкісних характеристик автомобіля КрАЗ-63221    з вибором гакової підвіски механізму підйому вантажу']
cursor.execute("INSERT INTO users VALUES(?,?,?,?,?,?);", users_list)
cursor.execute("INSERT INTO users VALUES(?,?,?,?,?,?);", users_list2)
cursor.execute("INSERT INTO users VALUES(?,?,?,?,?,?);", users_list3)
cursor.execute("INSERT INTO users VALUES(?,?,?,?,?,?);", users_list4)
cursor.execute("INSERT INTO users VALUES(?,?,?,?,?,?);", users_list5)
connect.commit()